Перем ЮТесты;

Функция ПолучитьСписокТестов(Тестировщик) Экспорт
	ЮТесты = Тестировщик;

	ВсеТесты = Новый Массив;
	ВсеТесты.Добавить("ТестДолжен_ПроверитьЛокальнуюИнформациюОбОшибке");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьСтекВызовов");

	Возврат ВсеТесты;
КонецФункции

Процедура ТестДолжен_ПроверитьЛокальнуюИнформациюОбОшибке() Экспорт
    Попытка
        Сумма = 100 / 0;
    Исключение
        Информация = ИнформацияОбОшибке();

        ЮТесты.ПроверитьРавенство(DivideByZeroText(Информация.Описание), Информация.Описание);
        ЮТесты.ПроверитьРавенство(15, Информация.НомерСтроки);
        ЮТесты.ПроверитьИстину(СтрЗаканчиваетсяНа(Информация.ИмяМодуля, "ErrorInfo.os"));
        ЮТесты.ПроверитьИстину(СтрНайти(Информация.ИсходнаяСтрока, "Сумма = 100 / 0;") > 0);
        ЮТесты.ПроверитьИстину(Информация.Причина = Неопределено);

        ПодробноеОписаниеОшибки = Информация.ПодробноеОписаниеОшибки();
        ЮТесты.ПроверитьИстину(СтрНайти(ПодробноеОписаниеОшибки, DivideByZeroText(Информация.Описание)) > 0);
    КонецПопытки;
КонецПроцедуры

Процедура ТестДолжен_ПроверитьСтекВызовов()
    ПроверитьСтекВызова();
КонецПроцедуры

Процедура ПроверитьСтекВызова()
    Попытка
            Сумма = 100 / 0;
    Исключение
        Информация = ИнформацияОбОшибке();
        СтекВызовов = Информация.ПолучитьСтекВызовов();

        СтекВызова = СтекВызовов[0];
        ЮТесты.ПроверитьРавенство("ПроверитьСтекВызова", СтекВызова.Метод);
        ЮТесты.ПроверитьРавенство(36, СтекВызова.НомерСтроки);
        ЮТесты.ПроверитьИстину(СтрЗаканчиваетсяНа(СтекВызова.ИмяМодуля, "ErrorInfo.os"));


        СтекВызова = СтекВызовов[1];
        ЮТесты.ПроверитьРавенство("ТестДолжен_ПроверитьСтекВызовов", СтекВызова.Метод);
        ЮТесты.ПроверитьРавенство(31, СтекВызова.НомерСтроки);
        ЮТесты.ПроверитьИстину(СтрЗаканчиваетсяНа(СтекВызова.ИмяМодуля, "ErrorInfo.os"));
    КонецПопытки;
КонецПроцедуры

Функция DivideByZeroText(ОписаниеОшибки)
    Если ОписаниеОшибки = "Divide by zero" Тогда
        Возврат "Divide by zero";
    КонецЕсли;

    Возврат ОписаниеОшибки;
КонецФункции
