Структура = Новый Структура;
Структура.Вставить("Ключ1", 1);
Структура.Вставить("Ключ2", 2);
Структура.Вставить("Ключ3", "ПроизвольнаяСтрока");

Сообщить(Структура.Количество());
Сообщить(Структура["Ключ1"]);

Структура.Удалить("Ключ1");

Сообщить(Структура["Ключ2"]);

Значение = Неопределено;
СвойствоЕсть = Структура.Свойство("Ключ2", Значение);
Сообщить("Свойство есть: " + СвойствоЕсть);
Сообщить(Значение);

СвойствоЕсть = Структура.Свойство("Ключ");
Сообщить("Свойство есть: " + СвойствоЕсть);

Структура.Очистить();

Сообщить(Структура.Количество())