// This Source Code Form is subject to the terms of the Mozilla Public
// License, v. 2.0. If a copy of the MPL was not distributed with this
// file, You can obtain one at https://mozilla.org/MPL/2.0/.
Перем юТест;

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	юТест = ЮнитТестирование;

	ВсеТесты = Новый Массив;
	ВсеТесты.Добавить("ТестДолжен_ПроверитьОстатокОтДеления");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьЧтоДелениеНаНольВыброситОшибку");

	Возврат ВсеТесты;
КонецФункции

Процедура ТестДолжен_ПроверитьОстатокОтДеления() Экспорт

	юТест.ПроверитьРавенство(3 % 1, 0, "3 % 1 == 0");
	юТест.ПроверитьРавенство(3.2 % 1, 0.2, "3.2 % 1 == 0.2");
	юТест.ПроверитьРавенство(-3.2 % 1, -0.2, "-3.2 % 1 == -0.2");
	юТест.ПроверитьРавенство(-3.2 % -1, -0.2, "-3.2 % -1 == 0.2");

КонецПроцедуры

Процедура ТестДолжен_ПроверитьЧтоДелениеНаНольВыброситОшибку() Экспорт

    БылоИсключение = Ложь;
    Попытка
        Ф = 1 % 0;
    Исключение
        БылоИсключение = Истина;
    КонецПопытки;

    юТест.ПроверитьРавенство(БылоИсключение, Истина, "Хотели исключение, а его не было");

КонецПроцедуры

