Перем юТест;

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	юТест = ЮнитТестирование;

	ВсеТесты = Новый Массив;
	ВсеТесты.Добавить("ТестДолжен_ПроверитьЦепочкуВызовов");
	Возврат ВсеТесты;
КонецФункции

Процедура ТестДолжен_ПроверитьЦепочкуВызовов() Экспорт

	Т = Новый ОписаниеТипов("Структура");
	С = Новый Структура;
	С.Вставить("К", 123);
	Т.ПривестиЗначение(С).К = 456; // свойство от метода объекта

	юТест.ПроверитьРавенство(С.К, 456, "Обращение к свойству результата вызова метода");

КонецПроцедуры
