Перем юТест;

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	юТест = ЮнитТестирование;

	ВсеТесты = Новый Массив;
	ВсеТесты.Добавить("ТестДолжен_ПроверитьСозданиеОбъектаСравнениеЗначений");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьСравнениеЧисел");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьСравнениеДат");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьСравнениеСтрок");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьСравнениеБулева");
	Возврат ВсеТесты;
КонецФункции

Процедура ТестДолжен_ПроверитьСозданиеОбъектаСравнениеЗначений() Экспорт

	Сравнение = Новый СравнениеЗначений;

КонецПроцедуры

Процедура ТестДолжен_ПроверитьСравнениеЧисел() Экспорт

	ПроверитьПростыеЗначения(0, 1);
	ПроверитьПростыеЗначения(-10, 10);

КонецПроцедуры

Процедура ТестДолжен_ПроверитьСравнениеДат() Экспорт

	ПроверитьПростыеЗначения('20220101', '20220102');
	ПроверитьПростыеЗначения('00010101', '20220102');
	ПроверитьПростыеЗначения('00010101', '00010101000001');

КонецПроцедуры

Процедура ТестДолжен_ПроверитьСравнениеСтрок() Экспорт

	ПроверитьПростыеЗначения("а", "б");
	ПроверитьПростыеЗначения("А", "а");
	ПроверитьПростыеЗначения("а", "ааа");
	ПроверитьПростыеЗначения("1", "111");
	ПроверитьПростыеЗначения("100", "11");

КонецПроцедуры

Процедура ТестДолжен_ПроверитьСравнениеБулева() Экспорт
    ПроверитьПростыеЗначения(Ложь, Истина);
КонецПроцедуры

Процедура ПроверитьПростыеЗначения(Знач Меньшее, Знач Большее)

	Сравнение = Новый СравнениеЗначений;
	юТест.ПроверитьИстину(Сравнение.Сравнить(Меньшее, Большее) < 0);
	юТест.ПроверитьИстину(Сравнение.Сравнить(Большее, Меньшее) > 0);
	юТест.ПроверитьИстину(Сравнение.Сравнить(Большее, Большее) = 0);
	юТест.ПроверитьИстину(Сравнение.Сравнить(Меньшее, Меньшее) = 0);

КонецПроцедуры
