Перем ЮнитТестирование;

Функция ПолучитьСписокТестов(Тестировщик) Экспорт
	ЮнитТестирование = Тестировщик;

	ВсеТесты = Новый Массив;
	ВсеТесты.Добавить("ТестДолжен_ПроверитьТекущуюДату");
	Возврат ВсеТесты;
КонецФункции

Процедура ТестДолжен_ПроверитьТекущуюДату() Экспорт

    Дата1 = ТекущаяДата();

    ЮнитТестирование.ПроверитьРавенство(ТипЗнч(Дата1), Тип("Дата"), "Текущая дата - это дата");

    Дата2 = ТекущаяДата();
    ЮнитТестирование.Проверить(Дата1 <= Дата2, "ТекущаяДата() не убывает");

КонецПроцедуры
