Перем ЮнитТестирование;

Функция ПолучитьСписокТестов(Тестировщик) Экспорт
	ЮнитТестирование = Тестировщик;

	ВсеТесты = Новый Массив;
	ВсеТесты.Добавить("ТестДолжен_ПроверитьТекущуюДату");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьЧтоНулиЭтоПустаяДата");
	Возврат ВсеТесты;
КонецФункции

Процедура ТестДолжен_ПроверитьТекущуюДату() Экспорт

    Дата1 = ТекущаяДата();

    ЮнитТестирование.ПроверитьРавенство(ТипЗнч(Дата1), Тип("Дата"), "Текущая дата - это дата");

    Дата2 = ТекущаяДата();
    ЮнитТестирование.Проверить(Дата1 <= Дата2, "ТекущаяДата() не убывает");

КонецПроцедуры

Процедура ТестДолжен_ПроверитьЧтоНулиЭтоПустаяДата() Экспорт

    ЮнитТестирование.ПроверитьРавенство('00000000',       '00010101', "00000000 - это 1 января 1 года");
    ЮнитТестирование.ПроверитьРавенство('000000000000',   '00010101', "0000000000 - это 1 января 1 года");
    ЮнитТестирование.ПроверитьРавенство('00000000000000', '00010101', "00000000000000 - это 1 января 1 года");

КонецПроцедуры
