Перем юТест;

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	юТест = ЮнитТестирование;

	ВсеТесты = Новый Массив;
	ВсеТесты.Добавить("Тест_ДолженПроверитьСвойствоОбъекта");
	ВсеТесты.Добавить("Тест_ДолженПроверитьМетоды");

	Возврат ВсеТесты;
КонецФункции

Процедура Тест_ДолженПроверитьСвойствоОбъекта()
    ОжидаемоеРасширение = "txt";
    ПутьКФайлу = ПолучитьИмяВременногоФайла(ОжидаемоеРасширение);

    РазделительПути = "";
    Если СтрНайти(ПутьКФайлу, "/") > 0 Тогда
        РазделительПути = "/";
    Иначе
        РазделительПути = "\";
    КонецЕсли;

    ЧастиПути = СтрРазделить(ПутьКФайлу, РазделительПути);
    ОжидаемоеИмя = ЧастиПути[ЧастиПути.Количество() - 1]
    ОжидаемоеИмяБезРасширения = Лев(ОжидаемоеИмя, СтрДлина(ОжидаемоеИмя) - СтрДлина(ОжидаемоеРасширение) - 2);
    Сообщить("ИмяБез = " + ОжидаемоеИмяБезРасширения)
    ОжидаемыйПуть = Лев(ПутьКФайлу, СтрДлина(ПутьКФайлу) - СтрДлина(ОжидаемоеИмя));

    Файл = Новый Файл(ПутьКФайлу);

    Имя = Файл.Имя;
    юТест.ПроверитьРавенство(ОжидаемоеИмя, Имя);

    ИмяБезРасширения = Файл.ИмяБезРасширения;
    юТест.ПроверитьРавенство(ОжидаемоеИмяБезРасширения, ИмяБезРасширения);

    Расширение = Файл.Расширение;
    юТест.ПроверитьРавенство(ОжидаемоеРасширение, Расширение);

    ПолноеИмя = Файл.ПолноеИмя;
    юТест.ПроверитьРавенство(ПутьКФайлу, ПолноеИмя);

    Путь = Файл.Путь;
    юТест.ПроверитьРавенство(ОжидаемыйПуть, Путь);
КонецПроцедуры

Процедура Тест_ДолженПроверитьМетоды()
    ПутьКФайлу = "src/test/resources/fixtures/TestFile.txt";

    Файл = Новый Файл(ПутьКФайлу);
    юТест.ПроверитьИстину(Файл.Существует());
    юТест.ПроверитьЛожь(Файл.ПолучитьНевидимость());
    юТест.ПроверитьЛожь(Файл.ПолучитьТолькоЧтение());
    юТест.ПроверитьРавенство(25, Файл.Размер());
    юТест.ПроверитьИстину(Файл.ПолучитьВремяИзменения() <> Дата(1, 1, 1));

    юТест.ПроверитьИстину(Файл.ЭтоФайл());
    юТест.ПроверитьЛожь(Файл.ЭтоКаталог());

    // TODO: реализовать проверку
    // УстановитьВремяИзменения
    // УстановитьНевидимость
    // УстановитьТолькоЧтение

    ПутьККаталогу = "src/test/resources/fixtures";
    Файл = Новый Файл(ПутьККаталогу);
    юТест.ПроверитьЛожь(Файл.ЭтоФайл());
    юТест.ПроверитьИстину(Файл.ЭтоКаталог());
КонецПроцедуры