///////////////////////////////////////////////////////////////////////
// Тест класса Соответствие
///////////////////////////////////////////////////////////////////////

Перем юТест;

////////////////////////////////////////////////////////////////////
// Программный интерфейс

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт

	юТест = ЮнитТестирование;

	ВсеТесты = Новый Массив;
	ВсеТесты.Добавить("ТестДолжен_СоздатьСоответствие");

	Возврат ВсеТесты;

КонецФункции

Процедура ТестДолжен_СоздатьСоответствие() Экспорт

	Соответствие = Новый Соответствие;

КонецПроцедуры
