Перем юТест;

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	юТест = ЮнитТестирование;

	ВсеТесты = Новый Массив;
	ВсеТесты.Добавить("Тест_ДолженПроверитьМетодНРег");
	ВсеТесты.Добавить("Тест_ДолженПроверитьМетодВРег");
	ВсеТесты.Добавить("Тест_ДолженПроверитьМетодТРег");
	ВсеТесты.Добавить("Тест_ДолженПроверитьМетодДлинуСтроки");
	ВсеТесты.Добавить("Тест_ДолженПроверитьМетодЛев");
	ВсеТесты.Добавить("Тест_ДолженПроверитьМетодПрав");
	ВсеТесты.Добавить("Тест_ДолженПроверитьМетодСред");
	ВсеТесты.Добавить("Тест_ДолженПроверитьМетодНайти");

	Возврат ВсеТесты;
КонецФункции

Процедура Тест_ДолженПроверитьМетодВРег()
    Значение = ВРег("значение");
    юТест.ПроверитьРавенство("ЗНАЧЕНИЕ", Значение);
КонецПроцедуры

Процедура Тест_ДолженПроверитьМетодТРег()
    Текст = "шЛА Маша по шоссе(и) Сосала ""Сушку""";
    юТест.ПроверитьРавенство("Шла Маша По Шоссе(И) Сосала ""Сушку""", ТРег(Текст));
КонецПроцедуры

Процедура Тест_ДолженПроверитьМетодНРег()
    Значение = НРег("ЗнаЧение");
    юТест.ПроверитьРавенство("значение", Значение);
КонецПроцедуры

Процедура Тест_ДолженПроверитьМетодДлинуСтроки()
    Длина = СтрДлина("З наЧен $ ие");
    юТест.ПроверитьРавенство(12, Длина);
КонецПроцедуры

Процедура Тест_ДолженПроверитьМетодЛев()
    Значение = "Значение";

    юТест.ПроверитьРавенство("Зна", Лев(Значение, 3));
    юТест.ПроверитьРавенство("Значение", Лев(Значение, 10));
    юТест.ПроверитьРавенство("", Лев(Значение, 0));
    юТест.ПроверитьРавенство("", Лев(Значение, -1));
КонецПроцедуры

Процедура Тест_ДолженПроверитьМетодПрав()
    Значение = "Значение";

    юТест.ПроверитьРавенство("ние", Прав(Значение, 3));
    юТест.ПроверитьРавенство("Значение", Прав(Значение, 10));
    юТест.ПроверитьРавенство("", Прав(Значение, 0));
    юТест.ПроверитьРавенство("", Прав(Значение, -1));
КонецПроцедуры

Процедура Тест_ДолженПроверитьМетодСред()
    Значение = "Значение";

    юТест.ПроверитьРавенство("", Сред(Значение, 2, 0));
    юТест.ПроверитьРавенство("начение", Сред(Значение, 2));
    юТест.ПроверитьРавенство("нач", Сред(Значение, 2, 3));
    юТест.ПроверитьРавенство("начени", Сред(Значение, 2, 6));
    юТест.ПроверитьРавенство("начение", Сред(Значение, 2, 7));
    юТест.ПроверитьРавенство("начение", Сред(Значение, 2, 11));
КонецПроцедуры

Процедура Тест_ДолженПроверитьМетодНайти()
    ГдеИскать = "Строка Строки Строчки Стр";
    ЧтоИскать = "Строки";
    Индекс = Найти(ГдеИскать, ЧтоИскать);
    юТест.ПроверитьРавенство(8, Индекс);

    ЧтоИскать = "Стр";
    Индекс = Найти(ГдеИскать, ЧтоИскать);
    юТест.ПроверитьРавенство(1, Индекс);

    ЧтоИскать = "Привет";
    Индекс = Найти(ГдеИскать, ЧтоИскать);
    юТест.ПроверитьРавенство(0, Индекс);
КонецПроцедуры