Перем ЮнитТестирование;

Функция ПолучитьСписокТестов(Тестировщик) Экспорт
	ЮнитТестирование = Тестировщик;

	ВсеТесты = Новый Массив;
	ВсеТесты.Добавить("ТестДолжен_Проверить_Окр");

	Возврат ВсеТесты;
КонецФункции

&Тест
Процедура ТестДолжен_Проверить_Окр() Экспорт

	ЮнитТестирование.ПроверитьРавенство( Окр(1234.567), 1235);
	ЮнитТестирование.ПроверитьРавенство( Окр(2234.567,2), 2234.57);
	ЮнитТестирование.ПроверитьРавенство( Окр(3234,-2), 3200);
	ЮнитТестирование.ПроверитьРавенство( Окр(4234.567,-2), 4200);

	ЮнитТестирование.ПроверитьРавенство( Окр(5234.55,1), 5234.6);
	ЮнитТестирование.ПроверитьРавенство( Окр(6234.55,1,0), 6234.5);
	ЮнитТестирование.ПроверитьРавенство( Окр(7234.55,1,1), 7234.6);
	ЮнитТестирование.ПроверитьРавенство( Окр(8234.555,1,0), 8234.6);
	ЮнитТестирование.ПроверитьРавенство( Окр(9234.55,1,-4), 9234.6);

	ЮнитТестирование.ПроверитьРавенство( Окр(10250,-2,0), 10200);
	ЮнитТестирование.ПроверитьРавенство( Окр(11251,-2,0), 11300);
	ЮнитТестирование.ПроверитьРавенство( Окр(12251,-2,1), 12300);
	ЮнитТестирование.ПроверитьРавенство( Окр(-13250,-2,0), -13200);
	ЮнитТестирование.ПроверитьРавенство( Окр(-14251,-2,0), -14300);
	ЮнитТестирование.ПроверитьРавенство( Окр(-15250,-2,1), -15300);

	ЮнитТестирование.ПроверитьРавенство( Окр(-16234.55,1,0), -16234.5);
	ЮнитТестирование.ПроверитьРавенство( Окр(-17234.55,1,1), -17234.6);
	ЮнитТестирование.ПроверитьРавенство( Окр(-18234.551,1,0), -18234.6);
	ЮнитТестирование.ПроверитьРавенство( Окр(-19234.551,1,1), -19234.6);

	ЮнитТестирование.ПроверитьРавенство( Окр("20234.5","0",-1.9), 20235);

КонецПроцедуры
