Перем юТест;

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	юТест = ЮнитТестирование;

	ВсеТесты = Новый Массив;
	ВсеТесты.Добавить("ТестДолжен_ПроверитьСвойство_ТолькоЧтение");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьСвойство_ТолькоЗапись");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьСвойство_ЧтениеЗапись");

	Возврат ВсеТесты;

КонецФункции

Процедура ТестДолжен_ПроверитьСвойство_ТолькоЧтение() Экспорт

	Объект = Новый ТестСвойств;
	юТест.ПроверитьРавенство(Объект.ТолькоЧтение, 42);

	БылоИсключение = Ложь;
	Попытка
		Объект.ТолькоЧтение = 123;
	Исключение
		БылоИсключение = Истина;
	КонецПопытки;

	юТест.ПроверитьИстину(БылоИсключение, "Запись в свойство только для чтения должно вызвать исключение");

КонецПроцедуры

Процедура ТестДолжен_ПроверитьСвойство_ТолькоЗапись() Экспорт

	Объект = Новый ТестСвойств;
	Объект.ТолькоЗапись = 1;
	Объект.ТолькоЗапись = 2;

	БылоИсключение = Ложь;
	Попытка
		ЧтоЗаписано = Объект.ТолькоЗапись;
	Исключение
		БылоИсключение = Истина;
	КонецПопытки;

	юТест.ПроверитьИстину(БылоИсключение, "Чтение свойства только для записи должно вызвать исключение");

КонецПроцедуры

Процедура ТестДолжен_ПроверитьСвойство_ЧтениеЗапись() Экспорт

	Объект = Новый ТестСвойств;
	Объект.Свойство = 42;
	юТест.ПроверитьРавенство(Объект.ТолькоЧтение, 42);

КонецПроцедуры
