Перем юТест;

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	юТест = ЮнитТестирование;

	ВсеТесты = Новый Массив;
	ВсеТесты.Добавить("ТестДолжен_ПроверитьСравнениеСтрок");

	Возврат ВсеТесты;
КонецФункции

Процедура ТестДолжен_ПроверитьСравнениеСтрок()
    юТест.ПроверитьИстину("ааа" = "ааа");
    юТест.ПроверитьЛожь("ааа" = "Ааа");
    юТест.ПроверитьЛожь("ааа" = "Баа");
    юТест.ПроверитьЛожь("ааа" = "аааа");

    юТест.ПроверитьЛожь("ааа" > "ааа");
    юТест.ПроверитьИстину("ааа" > "Ааа");
    юТест.ПроверитьИстину("ааа" >= "ааа");
    юТест.ПроверитьЛожь("ааа" < "ааа");
    юТест.ПроверитьЛожь("ааа" < "Ааа");
    юТест.ПроверитьИстину("ааа" <= "ааа");

    юТест.ПроверитьИстину("ааа" <> "Ааа");
КонецПроцедуры