Перем ЮнитТестирование;

Функция ПолучитьСписокТестов(Тестировщик) Экспорт
	ЮнитТестирование = Тестировщик;

	ВсеТесты = Новый Массив;
	ВсеТесты.Добавить("ТестДолжен_ПроверитьСокрП");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьСокрЛ");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьСокрЛП");
	Возврат ВсеТесты;
КонецФункции

&Тест
Процедура ТестДолжен_ПроверитьСокрП() Экспорт

    Значение = "Значение  ";
    НовоеЗначение = СокрП(Значение);
    ЮнитТестирование.ПроверитьРавенство(НовоеЗначение, "Значение");

    Значение = "  Значение";
    НовоеЗначение = СокрП(Значение);
    ЮнитТестирование.ПроверитьРавенство(НовоеЗначение, Значение);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПроверитьСокрЛ() Экспорт

    Значение = "  Значение";
    НовоеЗначение = СокрЛ(Значение);
    ЮнитТестирование.ПроверитьРавенство(НовоеЗначение, "Значение");

    Значение = "Значение  ";
    НовоеЗначение = СокрЛ(Значение);
    ЮнитТестирование.ПроверитьРавенство(НовоеЗначение, Значение);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПроверитьСокрЛП() Экспорт
    Значение = "  Значение  ";
    НовоеЗначение = СокрЛП(Значение);
    ЮнитТестирование.ПроверитьРавенство(НовоеЗначение, "Значение");

    Значение = "Значение  ";
    НовоеЗначение = СокрЛП(Значение);
    ЮнитТестирование.ПроверитьРавенство(НовоеЗначение, "Значение");

    Значение = "  Значение";
    НовоеЗначение = СокрЛП(Значение);
    ЮнитТестирование.ПроверитьРавенство(НовоеЗначение, "Значение");
КонецПроцедуры