Перем ЮнитТестирование;

Функция ПолучитьСписокТестов(Тестировщик) Экспорт
	ЮнитТестирование = Тестировщик;

	ВсеТесты = Новый Массив;
	ВсеТесты.Добавить("ТестДолжен_ПреобразованиеВСтроку");
	ВсеТесты.Добавить("ТестДолжен_ПреобразованиеВЧисло");
	Возврат ВсеТесты;
КонецФункции

Процедура ТестДолжен_ПреобразованиеВСтроку() Экспорт

    ЮнитТестирование.ПроверитьРавенство(Строка(1), "1", "Число в строку");
    ЮнитТестирование.ПроверитьРавенство(Строка(1000), "1000", "Число в строку (триады)"); // без разделителя триад по-умолчанию

    ЮнитТестирование.ПроверитьРавенство(Строка(-1), "-1", "Число в строку отрицательное");
    ЮнитТестирование.ПроверитьРавенство(Строка(-1000), "-1000", "Число в строку отрицательное (триады)");

    ЮнитТестирование.ПроверитьРавенство(Строка(1.23), "1.23", "Число в строку (дробное)");
    ЮнитТестирование.ПроверитьРавенство(Строка(-1.23), "-1.23", "Число в строку отрицательное (дробное)");

КонецПроцедуры

Процедура ТестДолжен_ПреобразованиеВЧисло() Экспорт

    ЮнитТестирование.ПроверитьРавенство(Число("1"), 1, "Строка в число");
    ЮнитТестирование.ПроверитьРавенство(Число("-1"), -1, "Строка в отрицательное число");

КонецПроцедуры
