///////////////////////////////////////////////////////////////////////
// Тест класса УникальныйИдентификатор
///////////////////////////////////////////////////////////////////////

Перем юТест;

////////////////////////////////////////////////////////////////////
// Программный интерфейс

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	юТест = ЮнитТестирование;

	ВсеТесты = Новый Массив;

	ВсеТесты.Добавить("ТестДолжен_СоздатьНовыйУуид");
	ВсеТесты.Добавить("ТестДолжен_СоздатьНовыйУуидИзСтроки");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьНевалидныйУуид");

	Возврат ВсеТесты;
КонецФункции

Процедура ТестДолжен_СоздатьНовыйУуид() Экспорт
    Ууид = Новый УникальныйИдентификатор();
    УуидАнгл = Новый Uuid();

    юТест.ПроверитьИстину(Ууид <> УуидАнгл);
    юТест.ПроверитьРавенство(4, СтрЧислоВхождений(Ууид, "-"));
КонецПроцедуры

Процедура ТестДолжен_СоздатьНовыйУуидИзСтроки()
    УуидСтрокой = "9f62ff3e-546d-11ed-bdc3-0242ac120002";
    Ууид = Новый УникальныйИдентификатор(УуидСтрокой);

    юТест.ПроверитьРавенство(УуидСтрокой, Строка(Ууид));

    Ууид = Новый УникальныйИдентификатор();
    НовыйУуид = Новый УникальныйИдентификатор("" + Ууид);

    юТест.ПроверитьРавенство(Ууид, НовыйУуид);
КонецПроцедуры

Процедура ТестДолжен_ПроверитьНевалидныйУуид()
    УуидСтрокой = "Это ууид?";

    БылаОшибка = Ложь;
    Попытка
        Ууид = Новый УникальныйИдентификатор(УуидСтрокой);
    Исключение
        БылаОшибка = Истина;
    КонецПопытки;

    юТест.ПроверитьИстину(БылаОшибка);
КонецПроцедуры