///////////////////////////////////////////////////////////////////////
//
// Тест проверки работы таблицы значений
//
//
///////////////////////////////////////////////////////////////////////

Перем юТест;

////////////////////////////////////////////////////////////////////
// Программный интерфейс

Функция Версия() Экспорт
	Возврат "0.2";
КонецФункции

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт

	юТест = ЮнитТестирование;
	ВсеТесты = Новый Массив;

	ВсеТесты.Добавить("ТестДолжен_СоздатьТаблицуЗначенийСИндексами");

	Возврат ВсеТесты;

КонецФункции

Процедура ТестДолжен_СоздатьТаблицуЗначенийСИндексами() Экспорт

	Т = Новый ТаблицаЗначений;
	Т.Колонки.Добавить("К1");
	Т.Колонки.Добавить("К2");
	Т.Колонки.Добавить("К3");

	И1 = Т.Индексы.Добавить("К1");
	И2 = Т.Индексы.Добавить("К1,К2");
	И3 = Т.Индексы.Добавить("К1,К2,К3");

	юТест.ПроверитьРавенство(Т.Индексы.Количество(), 3);

	Т.Индексы.Удалить(Т.Индексы[0]);
	юТест.ПроверитьРавенство(Т.Индексы.Количество(), 2);

	Т.Колонки.К1.Имя = "К_1";
	юТест.ПроверитьРавенство(Т.Индексы[0][0], "К_1");

	Для Каждого мИндекс Из Т.Индексы Цикл

		Для Каждого мИмяКолонки Из мИндекс Цикл

			Колонка = Т.Колонки.Найти(мИмяКолонки);
			юТест.ПроверитьНеравенство(Колонка, Неопределено, "Не найдена колонка " + мИмяКолонки);

		КонецЦикла;

	КонецЦикла;

	Т.Индексы.Очистить();
	юТест.ПроверитьРавенство(Т.Индексы.Количество(), 0);

КонецПроцедуры
