// This Source Code Form is subject to the terms of the Mozilla Public
// License, v. 2.0. If a copy of the MPL was not distributed with this
// file, You can obtain one at https://mozilla.org/MPL/2.0/.

Перем юТест;

Функция ПолучитьСписокТестов(Тестировщик) Экспорт

	юТест = Тестировщик;

	ВсеТесты = Новый Массив;
	ВсеТесты.Добавить("ТестДолжен_ПроверитьЗаполненностьЗначений");

	Возврат ВсеТесты;

КонецФункции


Процедура ТестДолжен_ПроверитьЗаполненностьЗначений() Экспорт

	юТест.ПроверитьИстину(ЗначениеЗаполнено(1));
	юТест.ПроверитьИстину(ЗначениеЗаполнено(Истина));
	юТест.ПроверитьИстину(ЗначениеЗаполнено(Ложь));
	//юТест.ПроверитьИстину(ЗначениеЗаполнено(ТекущаяДата()));
	юТест.ПроверитьИстину(ЗначениеЗаполнено("123"));
	//юТест.ПроверитьИстину(ЗначениеЗаполнено(Новый Структура("СКлючом")));

	юТест.ПроверитьЛожь(ЗначениеЗаполнено(Неопределено));
	юТест.ПроверитьЛожь(ЗначениеЗаполнено(Null));
	юТест.ПроверитьЛожь(ЗначениеЗаполнено(""));
	юТест.ПроверитьЛожь(ЗначениеЗаполнено(0));

	юТест.ПроверитьЛожь(ЗначениеЗаполнено('00010101'));
	юТест.ПроверитьЛожь(ЗначениеЗаполнено('000101010000'));
	юТест.ПроверитьЛожь(ЗначениеЗаполнено('00010101000000'));
	юТест.ПроверитьЛожь(ЗначениеЗаполнено('00000000'));
	юТест.ПроверитьЛожь(ЗначениеЗаполнено('000000000000'));
	юТест.ПроверитьЛожь(ЗначениеЗаполнено('00000000000000'));

//	юТест.ПроверитьЛожь(ЗначениеЗаполнено(Новый Массив));
//	юТест.ПроверитьЛожь(ЗначениеЗаполнено(Новый Структура));
//	юТест.ПроверитьЛожь(ЗначениеЗаполнено(Новый Соответствие));

КонецПроцедуры
