Перем юТест;

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	
	юТест = ЮнитТестирование;
	
	ВсеТесты = Новый Массив;
	
	ВсеТесты.Добавить("ТестДолжен_ПроверитьБулево");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьЧисло");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьСтроку");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьДату");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьТип");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьТипЗнч");
	
	Возврат ВсеТесты;
КонецФункции

Процедура ТестДолжен_ПроверитьБулево() Экспорт

	юТест.ПроверитьРавенство(Булево(0), Ложь);
	юТест.ПроверитьРавенство(Булево(1), Истина);
	юТест.ПроверитьРавенство(Булево(999), Истина);

	юТест.ПроверитьРавенство(Булево("Ложь"), Ложь);
	юТест.ПроверитьРавенство(Булево("Истина"), Истина);

	ЕстьОшибка = Ложь;
	Попытка
		юТест.ПроверитьРавенство(Булево("Это лишь слова"), Истина);
	Исключение
		ЕстьОшибка = Истина;
	КонецПопытки;
	юТест.ПроверитьИстину(ЕстьОшибка);

КонецПроцедуры

Процедура ТестДолжен_ПроверитьЧисло() Экспорт

	юТест.ПроверитьРавенство(Число("0"), 0);
	юТест.ПроверитьРавенство(Число("1"), 1);
	юТест.ПроверитьРавенство(Число("1.1"), 1.1);

	ЕстьОшибка = Ложь;
	Попытка
		юТест.ПроверитьРавенство(Число("Ложь"), 0);
	Исключение
		ЕстьОшибка = Истина;
	КонецПопытки;
	юТест.ПроверитьИстину(ЕстьОшибка);

КонецПроцедуры

Процедура ТестДолжен_ПроверитьСтроку() Экспорт

	юТест.ПроверитьРавенство(Строка("Моя строка"), "Моя строка");
	юТест.ПроверитьРавенство(Строка(Неопределено), "");
	юТест.ПроверитьРавенство(Строка(1), "1");
	//юТест.ПроверитьРавенство(Строка(Истина), "Да"); // FIXME: починить локализацию, не работает не на ru (=Yes)
	юТест.ПроверитьНеРавенство(Строка(ТекущаяДата()), "");
	юТест.ПроверитьРавенство(Строка(Новый Массив), "Массив");
	юТест.ПроверитьРавенство(Строка(ТипЗнч(Новый Массив)), "Массив");

КонецПроцедуры

Процедура ТестДолжен_ПроверитьДату() Экспорт

    // FIXME: починить локализацию, не работает не на ru

	Значение = Дата("20210101");
	//юТест.ПроверитьРавенство(Строка(Значение), "01.01.2021 0:00:00");

	Значение = Дата(2021, 1, 1);
	//юТест.ПроверитьРавенство(Строка(Значение), "01.01.2021 0:00:00");

	Значение = Дата(2021, 1, 1, 1, 1, 1);
	//юТест.ПроверитьРавенство(Строка(Значение), "01.01.2021 1:01:01");

КонецПроцедуры

Процедура ТестДолжен_ПроверитьТип() Экспорт
	юТест.ПроверитьРавенство(Строка(Тип("Строка")), "Строка");
	юТест.ПроверитьРавенство(Строка(Тип("Массив")), "Массив");

	ЕстьОшибка = Ложь;
	Попытка
		юТест.ПроверитьНеРавенство(Строка(Тип(Неопределено)), "");	
	Исключение
		ЕстьОшибка = Истина;
	КонецПопытки;
	юТест.ПроверитьИстину(ЕстьОшибка);

КонецПроцедуры

Процедура ТестДолжен_ПроверитьТипЗнч() Экспорт
	юТест.ПроверитьРавенство(Строка(ТипЗнч(Неопределено)), "Неопределено");
	юТест.ПроверитьРавенство(Строка(ТипЗнч(0)), "Число");
	юТест.ПроверитьРавенство(Строка(ТипЗнч(Новый Массив)), "Массив");
КонецПроцедуры